Revit 2026 API

# ElectricalSystemApparentLoadPhaseC Property

---

The ApparentLoadPhaseC value of the Electrical System.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double ApparentLoadPhaseC { get; }
```
```vb
Public ReadOnly Property ApparentLoadPhaseC As Double
	Get
```
```cpp
public:
property double ApparentLoadPhaseC {
	double get ();
}
```
```fsharp
member ApparentLoadPhaseC : float with get
```

#### Property Value

Double

| Exception | Condition |
| --- | --- |
| InvalidOperationException | This property only available when System Type is Power! |

This property is used to retrieve the ApparentLoadPhaseC value of the Electrical System.

#### Reference

ElectricalSystem Class

Autodesk.Revit.DB.Electrical Namespace